import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;

// 오리
public class Bj12933 {
    public static void main(String[] args) throws IOException {
        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));

        int[] quack = {'q','u','a','c','k'};
        int[] quackDuck = new int[5]; // 각 알파벳으로 울고 있는 오리 수
        char[] sound = br.readLine().toCharArray();

        int max = 0; // 동시에 울고 있는 최대 오리 수.
        int isCorrectDuck = 1; // 제대로 울었는 지 체크.

        int len = sound.length;

        loop: for(int i=0;i<len;i++){
            char c = sound[i]; // 현재 울음소리

            // q는 단순히 숫자만 더해준다.
            if(c==quack[0]){
                quackDuck[0]++; // 'q'
            }

            for(int j=1;j<5;j++){
                if(c==quack[j]){
                    // u,a,c,k는 바로 앞 울음소리 오리가 없다면 error
                    if(quackDuck[j-1]==0){
                        isCorrectDuck = 0;
                        break loop; // 바로 탈출
                    }

                    // 그 전 울음소리를 하나 빼주고
                    quackDuck[j-1]--;
                    // 그 다음 울음 소리 하나 추가.
                    if(j!=4) quackDuck[j]++; // j==4 인 경우 다 울었으니 안 더해주어도 됨.
                }
            }

            int currentDuck = 0; // 현재 울고 있는 오리 수.
            for(int duck:quackDuck){
                currentDuck+=duck;
            }
            // 최대 울음 오리보다 크면 최대 오리 갱신.
            if(currentDuck>max) max = currentDuck;
        }

        // 아직도 우는 오리 있으면 error
        for(int duck:quackDuck){
             if(duck != 0) isCorrectDuck = 0;
        }

        // error -> -1, 정상이면 최대 울음 오리 출력.
        if(isCorrectDuck == 1){
            System.out.println(max);
        } else{
            System.out.println("-1");
        }
    }
}


/*
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⡶⠞⠋⠀⠀⠀⠈⠈⠉⠛⠛⠛⠛⠛⣻⣿⣿⣿⣿⣿⣿⣷⣤⡀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡶⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠶⠒⠀⠀⠀⠀⠀⠀⠉⠻⣿⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⡾⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡞⠁⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⡼⠿⠟⢿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⠟⣽⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡟⠀⠀⠀⠀⣀⣠⣴⠶⠟⠛⠉⠀⠀⠀⠀⠈
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠏⠀⣼⠃⠀⠀⢀⣤⣤⣤⣀⠀⠀⠀⠀⠀⣼⣁⣤⡴⠾⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⢯⣄⣠⡟⠀⠀⣴⠋⠁⠀⠀⠙⢿⣦⠀⠀⠀⣿⠉⠁⠀⠀⠀⠘⢻⡇⠀⠀⠀⠀⠀⠀⠀⠀⣀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡟⠀⢈⢹⡇⠀⠀⡇⠀⠀⠀⢀⣀⠈⢿⣷⠀⠀⢸⡆⠀⠀⠀⠀⠘⠿⠇⠀⠀⠀⣀⣠⣴⠾⢻⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣇⠀⠾⢸⡇⠀⠀⡇⠀⠀⠀⠸⣿⡇⠈⣿⣧⠀⠈⢷⡄⠀⠀⠀⠀⣀⣠⣴⠶⠟⠋⠉⠀⣠⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣀⡀⠸⣇⠀⠀⡇⠀⠀⠀⠀⠈⠀⠀⢸⣿⡆⠀⠀⠙⢦⣴⠶⠟⠋⠉⠀⠀⠀⠀⣠⣴⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣩⣿⣿⡀⠀⡇⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠉⠛⠶⢦⣤⣤⣶⣶⠿⠿⢿⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⢿⣿⣇⠀⡇⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿
⠀⠀⠀⠀⠀⣸⣆⠀⢀⣀⣄⣤⣤⣤⣶⣶⣤⣀⠉⢻⣶⠇⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿
⠀⣀⣀⡀⠀⡟⢹⡄⠀⣿⣿⣿⣿⣿⣿⡿⠛⠁⣀⡴⠋⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿
⣿⣿⣿⡇⢀⡇⠀⢻⡀⠘⣿⣿⣿⠟⠁⣀⡴⠞⠉⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿
⣿⣿⣿⡇⢸⡇⠀⠈⣷⠀⢹⣿⠏⢀⡾⠋⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣾⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢨⣿⣿⣿⣿
⣿⣿⣿⡇⢸⡇⠀⠀⠘⣧⠀⢻⠀⣼⢇⣀⣀⣀⣀⣀⣤⣴⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿
⣿⣿⣿⡇⢸⡇⠀⠀⠀⢻⡆⠀⠀⢿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⡇⠈⡇⠀⠀⠀⠈⣿⡄⠀⠈⠻⠿⠿⣿⣿⡿⠿⠿⠟⠛⠉⢻⣆⠹⢿⣿⠿⠋⠀⠀⠀⣀⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣷⠀⣿⠀⠀⠀⣠⠻⣷⡀⢹⣶⣤⣤⣤⣤⣤⣤⣴⣶⣾⣧⠀⢻⣆⠠⣤⣶⣶⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⡄⢸⡆⣠⠞⠁⢀⣿⣧⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⢻⣆⠹⣿⣿⣿⣿⣿⣿⡿⠿⠛⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣷⠀⢿⠋⠀⣠⣿⣿⣿⣇⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⢻⣆⠹⣿⣿⠟⠋⠁⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⡆⠘⣧⣾⣿⣿⣿⣿⣿⡆⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⣠⣿⠞⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⡄⠘⠛⠉⢹⣿⣿⣿⣿⣄⣈⣉⣉⣉⡉⠉⠉⠉⠉⣀⡴⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣼⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣦⣤⠀⢸⡀⠀⠈⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⢣⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
 */